#!/bin/bash

# 定义 budget 列表
# num          4  10  20  30  40  50  60  70   80   90    100  150  200   250  300  350  400  450  500  550  600  700   800   900   1000  1100  1200  1300  1400  1500  1600  1700  1800  1900  2000
# uniform      59 147 293 439 585 732 878 1024 1170 1316  1463 2194 2925 3656 4387  5118 5849 6580 7311 8042 8773 10236 11698 13160 14622 16084 17546 19009 20471 21933 23395 24857 26319 27782 29244

budgets=(
 59 147 293 439 585 732 878 1024 1170 1316  1463 2194 2925 3656 4387  5118 5849 6580 7311 8042 8773 10236 11698 13160 14622 16084 17546 19009 20471 21933 23395 24857 26319 27782 29244

)

# 顺序执行
for b in "${budgets[@]}"; do
    echo "🚀 正在运行: python ../exp7_only_2phase_uniform_diabetic.py --budget=${b}"
    python ../exp7_only_2phase_uniform_diabetic.py --dataset=diabetic --batch_size=128 --max_epochs=16 --budget=${b} --num_workers=4 --device_ids=0 --gpu_ids=0
    echo "✅ budget=${b} 执行完成，等待 1 秒..."
    sleep 1
done

echo "🎉 所有 budget 执行完毕！"
